# CurtainCell Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainCell Class
Members See Also
---
Represents a CurtainCell within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class CurtainCell : APIObject
```

Visual Basic
---
```text
Public Class CurtainCell _
	Inherits APIObject
```

Visual C++
---
```text
public ref class CurtainCell : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..CurtainCell
# See Also
CurtainCell Members
Autodesk.Revit.DB Namespace